Revit 2027 API
RebarUpdateCurvesData.IsStyleChanged Property
 Indicates if the style has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsStyleChanged { get; }
Public ReadOnly Property IsStyleChanged As Boolean
	Get
public:
property bool IsStyleChanged {
	bool get ();
}
member IsStyleChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace